# Таблица значений

# Расчет таблицы значений функций v1  v2

# Переменные:
# x - аргумент
# v1,v2 - значения двух функций
# v2_max, v2_min - максимальное и минимальное значения функции v2
# v,h,a1,a2,a3,a4,s1,s2,s3,s4,s5 - символы псевдографики
# l, m, k, s - длина столбца, кол-во пробелов в шапке, строка из пробелов,
#              пробелы для строк с аргументами

from math import sqrt, log10

v = chr(9474)    # │
h = chr(9552)    # ═
a1 = chr(9554)   # ╒
a2 = chr(9557)   # ╕
a3 = chr(9560)   #  ╘
a4 = chr(9563)   # ╛
s1 = chr(9566)   # ╞
s2 = chr(9569)   #  ╡
s3 = chr(9572)   # ╤
s4 = chr(9575)   #  ╧
s5 = chr(9578)   # ╪

print(
    'Ограничение: начальный и конечный аргументы должены быть положительными')
error = True
while error:
    xn,sh,xk = map(float,
               input('Введите начальный аргумент, шаг и конечный аргумент: '
                         ).split())
    if (xk-xn)>0 and (sh)>0:
        error = False
    if (xk-xn)<0 and (sh)<0:
        error = False

x = xn
v2_max = 0
v2_min = x*x*x - 4*x*x + 10*x - 20
l = 22
m = l/2-1
k = ' ' * int(m)
s = ' ' * int(m-2)
#Вывод шапки таблицы
print(a1+h*l+s3+h*l+s3+h*l+a2)
print('{0}{1}x1{1}{0}{1}V1{1}{0}{1}V2{1}{0}'.format(v,k))
print(s1+h*l+s5+h*l+s5+h*l+s2)

while x <= xk:
    v1 = x*log10(x) - 1.2
    v2 = x*x*x - 4*x*x + 10*x - 20

    if v2_max<v2:
        v2_max = v2
    if v2<v2_min:
        v2_min = v2
    #Вывод строки таблицы
    if v2//1000000 != 0:
        print('{1}{0:14.4f}{4}{1}{2:14.4f}{4}{1}{5}{3:15.2e}{5} {1}'.format(
         x,v,v1,v2,s, ' '*int(m/2-2)))
    else:
        print('{1}{0:14.4f}{4}{1}{2:14.4f}{4}{1}{5}{3:15.2f}{5} {1}'.format(
         x,v,v1,v2,s, ' '*int(m/2-2)))
    x = x + sh
#Завершение таблицы
print(a3+h*22+s4+h*22+s4+h*22+a4)
print()
#Вывод ответа на вопрос
print('Разность между наименьшим и наибольшим значениями функции \n',
      'V2 = x*x*x - 4*x*x + 10*x - 20 равна {:.4f}'.format(v2_max - v2_min))
